================================================================================
True
================================================================================

true

--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (literal
          (trueLiteral))))))

================================================================================
False
================================================================================
false
--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (literal
          (falseLiteral))))))

================================================================================
Null
================================================================================
null
--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (literal
          (nullLiteral))))))

================================================================================
Identifier
================================================================================

hello2

--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (nameIdentifier)))))

================================================================================
Mapping
================================================================================

fun f() = 2

---

3

--------------------------------------------------------------------------------

(source_file
  (mapping
    (header
      (directive))
    body: (expression
      (value
        (literal
          (numberLiteral
            integer: (integer)))))))

================================================================================
Incomplete
================================================================================

(a: String) -> [1

--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (lambdaLiteral
          (lambdaParameters
            (parameter
              (nameIdentifier)
              (typeExpression
                (typeReferenceLiteral
                  (fullyQualifiedName
                    (nameIdentifier))))))
          (expression
            (value
              (array
                (expression
                  (value
                    (literal
                      (numberLiteral
                        (integer)))))
                (MISSING "]")))))))))

================================================================================
Incomplete2
================================================================================

[ 1, 2, 3

--------------------------------------------------------------------------------

(source_file
  (mapping
    (expression
      (value
        (array
          (expression
            (value
              (literal
                (numberLiteral
                  (integer)))))
          (expression
            (value
              (literal
                (numberLiteral
                  (integer)))))
          (expression
            (value
              (literal
                (numberLiteral
                  (integer)))))
          (MISSING "]"))))))
